py32-rs/py32-data/svd/PY32F032xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>CRC calculation unit</description>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <description>Data register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Independent Data register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>IDR</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Control register</description>
          <addressOffset>0x8</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>RESET</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMCU</name>
      <description>Debug support</description>
      <baseAddress>0x40015800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DBG_IDCODE</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DBG_ID</name>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Debug MCU Configuration Register</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DBG_SLEEP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_STOP</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_APB_FZ1</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DBG_TIM1_STOP</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>DBG_TIM3_STOP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>DBG_RTC_STOP</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DBG_WWDG_STOP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DBG_IWDG_STOP</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DBG_LPTIM1_STOP</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBG_APB_FZ2</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DBG_TIM14_STOP</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DBG_TIM16_STOP</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>DBG_TIM17_STOP</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>Direct memory access</description>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA_Channel1</name>
        <description>DMA Channel 1 Interrupt</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA_Channel2_3</name>
        <description>DMA Channel 2 and Channel 3 Interrupt</description>
        <value>10</value>
      </interrupt>
      <registers>
        <register>
          <name>ISR</name>
          <description>DMA interrupt status register(DMA_ISR)</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>TCIF1</name>
              <description>Transfer Complete Flag for Channel 1</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF1</name>
              <description>Block Transfer Complete Flag for Channel 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBTIF1</name>
              <description>Half Block Transfer Complete Flag for Channel 1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF1</name>
              <description>Transfer Error Flag for Channel 1</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF2</name>
              <description>Transfer Complete Flag for Channel 2</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF2</name>
              <description>Block Transfer Complete Flag for Channel 2</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBTIF2</name>
              <description>Half Block Transfer Complete Flag for Channel 2</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF2</name>
              <description>Transfer Error Flag for Channel 2</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TCIF3</name>
              <description>Transfer Complete Flag for Channel 3</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTCIF3</name>
              <description>Block Transfer Complete Flag for Channel 3</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HBTIF3</name>
              <description>Half Block Transfer Complete Flag for Channel 3</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEIF3</name>
              <description>Transfer Error Flag for Channel 3</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <description>DMA interrupt flag clear register(DMA_IFCR)</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CTCIF1</name>
              <description>Transfer Complete Flag Clear for Channel 1</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CBTCIF1</name>
              <description>Block Transfer Complete Flag Clear for Channel 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CHBTIF1</name>
              <description>Half Block Transfer Complete Flag Clear for Channel 1</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CTEIF1</name>
              <description>Transfer Error Flag Clear for Channel 1</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CTCIF2</name>
              <description>Transfer Complete Flag Clear for Channel 2</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CBTCIF2</name>
              <description>Block Transfer Complete Flag Clear for Channel 2</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CHBTIF2</name>
              <description>Half Block Transfer Complete Flag Clear for Channel 2</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CTEIF2</name>
              <description>Transfer Error Flag Clear for Channel 2</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CTCIF3</name>
              <description>Transfer Complete Flag Clear for Channel 3</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CBTCIF3</name>
              <description>Block Transfer Complete Flag Clear for Channel 3</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CHBTIF3</name>
              <description>Half Block Transfer Complete Flag Clear for Channel 3</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CTEIF3</name>
              <description>Transfer Error Flag Clear for Channel 3</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>DMA channel configuration register(DMA_CCR)</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <description>Block Transfer Complete Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <description>Half Block Transfer Complete Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data Transfer Direction</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular Mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <description>Transfer Type</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral Increment Mode</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory Increment Mode</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral Size</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory Size</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Priority Level</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory-to-memory Mode</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PNORLD</name>
              <description>Peripheral No Reload</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MNORLD</name>
              <description>Memory No Reload</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <description>Suspend in Block Transfer Complete Interrupt</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <description>Memory-to-memory Mode Arbitration</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR1</name>
          <description>DMA channel 1 number of dataregister</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of Data to Transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR1</name>
          <description>DMA channel 1 peripheral addressregister</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR1</name>
          <description>DMA channel 1 memory addressregister</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCFGR1</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <description>Number of Block to Loop Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <description>Number of Data to Transfer Last Loop</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>DMA channel configuration register(DMA_CCR)</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <description>Block Transfer Complete Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <description>Half Block Transfer Complete Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data Transfer Direction</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular Mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <description>Transfer Type</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral Increment Mode</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory Increment Mode</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral Size</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory Size</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Priority Level</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory-to-memory Mode</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PNORLD</name>
              <description>Peripheral No Reload</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MNORLD</name>
              <description>Memory No Reload</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <description>Suspend in Block Transfer Complete Interrupt</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <description>Memory-to-memory Mode Arbitration</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR2</name>
          <description>DMA channel 2 number of dataregister</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of Data to Transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR2</name>
          <description>DMA channel 2 peripheral addressregister</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR2</name>
          <description>DMA channel 2 memory addressregister</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCFGR2</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <description>Number of Block to Loop Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <description>Number of Data to Transfer Last Loop</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
