py32-rs/py32-data/svd/PY32F032xx.svd
        <register>
          <name>IOPENR</name>
          <description>GPIO clock enable register</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>GPIOAEN</name>
              <description>I/O PortA clock enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBEN</name>
              <description>I/O PortB clock enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOFEN</name>
              <description>I/O PortF clock enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBENR</name>
          <description>AHB peripheral clock enableregister</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>DMAEN</name>
              <description>DMA module clock enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASHEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SRAMEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <description>CRC module clock enabled</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR1</name>
          <description>APB peripheral clock enable register1</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>TIM3EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RTCAPBEN</name>
              <description>The RTC module APB clock is enabled</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WWDGEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI2EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>UART1EN</name>
              <description>The UART1 module clock is enabled</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>LPUART1EN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>I2C1EN</name>
              <description>I2C1 module clock enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>OPA1EN</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>OPA2EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>DBGEN</name>
              <description>MCU Debug module clock enable</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PWREN</name>
              <description>The Power interface module clock enables</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>LPTIM1EN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR2</name>
          <description>APB peripheral clock enable register2</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <description>The SYSCFG module clock is enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIM1EN</name>
              <description>The TIM1 module clock is enabled</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SPI1EN</name>
              <description>The SPI1 module clock is enabled</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USART1EN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TIM14EN</name>
              <description>TIM14 module clock enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIM16EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIM17EN</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ADCEN</name>
              <description>ADC block clock enabled</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP1EN</name>
              <description>COMP1 module clock enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP2EN</name>
              <description>COMP2 module clock enabled</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>VREFBUFEN</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR</name>
          <description>Peripherals independent clock configurationregister</description>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>TIMCLK_CTRL</name>
              <description>TIMER PCLK FREQUENCY CONTROL</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVDSEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP1SEL</name>
              <description>COMP1 module clock source selection</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP2SEL</name>
              <description>COMP2 module clock source selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LPUART1SEL</name>
              <bitRange>[12:11]</bitRange>
            </field>
            <field>
              <name>LPTIM1SEL</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>TIM1SEL</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TIM17SEL</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ADCSEL</name>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <description>RTC domain control register</description>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>LSEON</name>
              <description>LSE OSC enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSERDY</name>
              <description>LSE OSC ready</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LSEBYP</name>
              <description>LSE OSC bypass</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LSECSSON</name>
              <description>LSE CSS enables</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LSECSSD</name>
              <description>LSE CSS (clock security system) detection failed</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RTCSEL</name>
              <description>RTC clock source selection</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>RTC_HSEDIV_SEL</name>
              <description>The RTC clock source is selected as the division of the HSE clock</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>RTCEN</name>
              <description>RTC clock enabled</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BDRST</name>
              <description>RTC soft reset</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>LSCSEL</name>
              <description>Low-speed clock selection</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IWDGSEL</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>Control/status register</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>LSION</name>
              <description>LSI OSC enabled</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LSIRDY</name>
              <description>LSI OSC stability flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PINRST_FLTDIS</name>
              <description>NRST filtering is prohibited</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BORRSTF</name>
              <description>BOR reset flag</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RMVF</name>
              <description>Clear the reset flag</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>OBLRSTF</name>
              <description>Option byte loader reset flag</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>External NRST pin reset flag</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PORRSTF</name>
              <description>POR reset flag</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>Soft reset flag</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <description>IWDG reset flag</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
