py32-rs/py32-data/svd/PY32F032xx.svd
        <register>
          <name>CNT</name>
          <description>counter</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <description>prescaler</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PSC</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <description>auto-reload register</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>ARR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCR</name>
          <description>repetition counter register</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>REP</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>capture/compare register 1</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>CCR1</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CCR1_H</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>capture/compare register 2</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>CCR2</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CCR2_H</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <description>capture/compare register 3</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>CCR3</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CCR3_H</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <description>capture/compare register 4</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>CCR4</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDTR</name>
          <description>break and dead-time register</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>DTG</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OSSI</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OSSR</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BKE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BKP</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AOE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MOE</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR5</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>CCR5</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR6</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>CCR6</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR3</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>OC5FE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC5PE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC5M_L</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>OC5CE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OC6FE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC6PE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC6M_L</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>OC6CE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OC5M_H</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC6M_H</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TISEL</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>TI1SEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>TI2SEL</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>TI3SEL</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>TI4SEL</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AF1</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>BKINE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BKCMP1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BKCMP2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BKINP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BKCMP1P</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BKCMP2P</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ETRSEL</name>
              <bitRange>[17:14]</bitRange>
            </field>
            <field>
              <name>INTR_SEL</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>PWM_PHS_EN</name>
              <bitRange>[20:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AF2</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>OCRSEL</name>
              <bitRange>[18:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <description>DMA control register</description>
          <addressOffset>0x3DC</addressOffset>
          <fields>
            <field>
              <name>DBA</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DBL</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <description>DMA address for full transfer</description>
          <addressOffset>0x3E0</addressOffset>
          <fields>
            <field>
              <name>DMAB</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
