py32-rs/py32-data/svd/PY32F032xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIM16</name>
      <description>General purpose timer</description>
      <groupName>TIM</groupName>
      <baseAddress>0x40014400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIM16</name>
        <description>TIM16 global Interrupt</description>
        <value>21</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>TIM16 control register1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UDIS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>URS</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OPM</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMS</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ARPE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKD</name>
              <bitRange>[9:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>control register 2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CCPC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CCUS</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CCDS</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MMS_L</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TI1S</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OIS1</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OIS1N</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OIS2</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OIS2N</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OIS3</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>OIS3N</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OIS4</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>OIS5</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OIS6</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>MMS_H</name>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <description>DMA/Interrupt enable register</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>UIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC3IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC4IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UDE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC1DE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC2DE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3DE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4DE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>COMDE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TDE</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>status register</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>UIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC3IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC4IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>B2IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC1OF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC2OF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3OF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4OF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SBIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CC5IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CC6IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>IC1IR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>IC2IR</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC3IR</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC4IR</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <description>event generation register</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>UG</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1G</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2G</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC3G</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC4G</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMG</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TG</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BG</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_OUTPUT</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>CC1S</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC1FE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC1PE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC1M_L</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>OC1CE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC2S</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC2FE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC2PE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2M_L</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>OC2CE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OC1M_H</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC2M_H</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_INPUT</name>
          <alternateRegister>CCMR1_OUTPUT</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>CC1S</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC1PSC</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IC1F</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>CC2S</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2PSC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IC2F</name>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCER</name>
          <description>capture/compare enableregister</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>CC1E</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1P</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC1NE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC1NP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC2E</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CC2P</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CC2NE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CC2NP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC3E</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC3P</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC3NE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3NP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4E</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CC4P</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CC4NP</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CC5E</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CC5P</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CC6E</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CC6P</name>
              <bitRange>[21:21]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>counter</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <description>prescaler</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PSC</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <description>auto-reload register</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>ARR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCR</name>
          <description>repetition counter register</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>REP</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>capture/compare register 1</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>CCR1</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDTR</name>
          <description>break and dead-time register</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>DTG</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OSSI</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OSSR</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BKE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BKP</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AOE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MOE</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TISEL</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>TI1SEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>TI2SEL</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>TI3SEL</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>TI4SEL</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AF1</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>BKINE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BKCMP1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BKCMP2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BKINP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BKCMP1P</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BKCMP2P</name>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <description>DMA control register</description>
          <addressOffset>0x3DC</addressOffset>
          <fields>
            <field>
              <name>DBA</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DBL</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <description>DMA address for full transfer</description>
          <addressOffset>0x3E0</addressOffset>
          <fields>
            <field>
              <name>DMAB</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
